[Manufacturers.SeraphCrystal ManufacturerDefinition]
Grades[0]=(DisplayName="Seraphim of Christ")
Grades[1]=(DisplayName="maple syrup")
Grades[2]=(DisplayName="Crystal glass")
Grades[3]=(DisplayName="Seraphim Crystal")
Grades[4]=(DisplayName="Crystal")
Grades[5]=(DisplayName="Crystal Seraphim")
Grades[6]=(DisplayName="Psychic crystal")
Grades[7]=(DisplayName="Crystal Seraph")
Grades[8]=(DisplayName="Crystal syrup")
Grades[9]=(DisplayName="Seraphim Crystal")
Grades[10]=(DisplayName="Crystal Seraph")
Grades[11]=(DisplayName="Crystal juice")
Grades[12]=(DisplayName="Crystal Seraphim")
Grades[13]=(DisplayName="crystals")
Grades[14]=(DisplayName="The Seraph Crystal")
Grades[15]=(DisplayName="Crystal Seraphim")
Grades[16]=(DisplayName="Crystal Sheriff")

[UsableItems.Pickup_SeraphCrystal UsableItemDefinition]
UseFailureCharacterMessage="it should %s Use this article."
ItemName="Serifino Crystal"
PickupMessage="You have %s"
UseFailureLevelMessage="Must be at least %d level to use this feature.."
UseFailureConstraintsMessage="Crystal Max Syrup"
NoManufacturerName="normal, normal"

[UsableItems.Pickup_SeraphCrystal:AttributePresentationDefinition_4 AttributePresentationDefinition]
Description="A rare item from the Seraphim dealer.."
NoConstraintText=""
Suffix=""
Prefix=""

[UsableItems.Pickup_SeraphCrystal:AttributePresentationDefinition_6 AttributePresentationDefinition]
Description="Tell me later and it will be worth killing!"
NoConstraintText=""
Suffix=""
Prefix=""

